integration-quickstart/src/test/resources/org/fuwt/examples/sample-web-service-expected-request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" >
  <soap:Header/>
  <soap:Body>
    <GetInfoByZIP xmlns="http://www.webserviceX.NET">
      <USZip>07302</USZip>
    </GetInfoByZIP>
  </soap:Body>
</soap:Envelope>